bg/js/interface/mc/oceanTpl/MCStartReq.html

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Body>
        <ns1:MCStartReq xmlns:ns1="http://mobicom.oceanbank.ru/xsd" ns1:version="1.0" ns1:hash="{{hash}}">
            <ns1:Agregator>
                <ns1:id>{{agregatorId}}</ns1:id>
            </ns1:Agregator>
            <ns1:Merchant>
                <ns1:id>{{merchantId}}</ns1:id>
            </ns1:Merchant>
            <ns1:Owner>
                <ns1:id>{{ownerId}}</ns1:id>
            </ns1:Owner>
            <ns1:Client>
                <ns1:Phone>
                    <ns1:number>{{phone}}</ns1:number>
                    <ns1:provider>{{provider}}</ns1:provider>
                </ns1:Phone>
            </ns1:Client>
            <ns1:Payment>
                <ns1:amount>{{amount}}</ns1:amount>
                <ns1:currency>643</ns1:currency>
            </ns1:Payment>
            <ns1:Message>
                <ns1:bill>{{billTo}}</ns1:bill>
                <ns1:comment>{{info}}</ns1:comment>
            </ns1:Message>
        </ns1:MCStartReq>
    </soap:Body>
</soap:Envelope>